# LayoutRuleClearSpacing Class

---
This class indicate the layout rule of a Beam System is Clear-Spacing.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLayoutRule Autodesk.Revit.DBLayoutRuleClearSpacing
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class LayoutRuleClearSpacing : LayoutRule

    Public Class LayoutRuleClearSpacing
    	Inherits LayoutRule

    public ref class LayoutRuleClearSpacing : public LayoutRule

    type LayoutRuleClearSpacing =
        class
            inherit LayoutRule
        end
The LayoutRuleClearSpacing type exposes the following members.
| Name| Description
---|---|---
| LayoutRuleClearSpacing| Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.
Top
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| JustifyType| Get or set the type of justification.
| Spacing| Get or set the spacing of the beam system.
Top
| Name| Description
---|---|---
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
To use this type of LayoutRule, the distance between the beams and the justify-type must be set.
#### Reference
Autodesk.Revit.DB Namespace